ivek81cro/ESP32-C3-TemperatureLogger/src/ESP32TempLogger.cpp
#include "ESP32TempLogger.h"
#include "WiFiCredentials.h"

ESP32TempLogger::ESP32TempLogger()
    : oneWire(ONE_WIRE_BUS), sensors(&oneWire), timeClient(ntpUDP, "pool.ntp.org", 0, 60000) {}

void ESP32TempLogger::setup() {
    Serial.begin(115200);
    delay(2000);  // Allow Serial to stabilize
    Serial.println("Starting ESP32-C3...");

    // Connect to Wi-Fi
    connectToWiFi();
    WiFi.mode(WIFI_AP_STA);
    Serial.println(WiFi.macAddress());    

    prepareESPNOW();

    // Initialize NTP client
    timeClient.begin();

    // Initialize DS18B20 sensor
    sensors.begin();
    Serial.println("DS18B20 Initialized.");

    // Initialize SD card with retries
    if (!initializeSDCard()) {
        Serial.println("SD Card initialization failed after retries.");
        while (1);
    }
}

void ESP32TempLogger::loop() {
    // Check Wi-Fi connection
    checkWiFiConnection();

    // Request temperature
    sensors.requestTemperatures();
    float temperatureC = sensors.getTempCByIndex(0);

    // Format temperature reading with full timestamp
    String date = getFormattedDateTime();
    char dateArray[25];
    date.toCharArray(dateArray, 25);
    String dataString = date + String(", Temperature: ") + temperatureC + " °C\n";
    
    sendDataViaESPNOW(dateArray, temperatureC);

    Serial.print("Logging: ");
    Serial.print(dataString);

    // Open file and append data
    logDataToSD(dataString);

    // Enable deep sleep for 30 seconds
    Serial.println("Entering deep sleep for 30 seconds...");
    esp_sleep_enable_timer_wakeup(30 * 1000000ULL);
    esp_deep_sleep_start();
}

void ESP32TempLogger::connectToWiFi() {
    Serial.print("Connecting to WiFi...");
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD, 0);
    while (WiFi.status() != WL_CONNECTED) {
        delay(1000);
        Serial.print(".");
    }
    Serial.println("Connected.");
}

void ESP32TempLogger::checkWiFiConnection() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("WiFi disconnected. Reconnecting...");
        connectToWiFi();
    }
}

bool ESP32TempLogger::initializeSDCard() {
    SPI.begin(SPI_SCK_PIN, SPI_MISO_PIN, SPI_MOSI_PIN, SD_CS_PIN);
    for (int i = 0; i < 5; i++) {
        if (sd.begin(SD_CS_PIN, SD_SCK_MHZ(8))) {  // 8 MHz for stability
            Serial.println("SD Card Initialized.");
            return true;
        }
        Serial.println("Retrying SD card initialization...");
        delay(1000);
    }
    return false;
}

bool ESP32TempLogger::ensureSDMounted() {
    if (!sd.card()->isBusy()) {
        Serial.println("SD Card not mounted. Attempting to remount...");
        return initializeSDCard();
    }
    return true;
}

String ESP32TempLogger::getFormattedDateTime() {
    timeClient.update();
    time_t rawTime = timeClient.getEpochTime();
    struct tm* timeInfo = localtime(&rawTime);
    char buffer[25];
    strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", timeInfo);
    return String(buffer);
}

bool ESP32TempLogger::readDataFromSD(String &data) {
    if (!ensureSDMounted()) {
        return false;
    }
    dataFile = sd.open("data.txt", FILE_READ);
    if (!dataFile) {
        Serial.println("Failed to open file for reading");
        return false;
    }
    data = dataFile.readString();
    dataFile.close();
    return true;
}

void ESP32TempLogger::prepareESPNOW() {
    // Init ESP-NOW
    if (esp_now_init() != ESP_OK) {
        Serial.println("Error initializing ESP-NOW");
        return;
    }

    // Register for Send Callback to get the status of transmitted packet
    esp_now_register_send_cb(OnDataSent);

    // Register peer
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;
    peerInfo.encrypt = false;

    // Add peer
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {
        Serial.println("Failed to add peer");
        return;
    }

    // Register for a callback function that will be called when data is received
    esp_now_register_recv_cb(OnDataRecv);
}

void ESP32TempLogger::sendDataViaESPNOW(const char* date, float temperature) {
    espNow_message messagePacket;
    strncpy(messagePacket.dateAndTime, date, sizeof(messagePacket.dateAndTime) - 1);
    messagePacket.dateAndTime[sizeof(messagePacket.dateAndTime) - 1] = '\0'; // Ensure null-termination
    messagePacket.temperature = temperature;
    
    esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *) &messagePacket, sizeof(messagePacket));
    
    if (result == ESP_OK) {
        Serial.println("Sent with success");
    } else {
        Serial.println("Error sending the data");
    }
}

void ESP32TempLogger::OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
    Serial.print("\r\nLast Packet Send Status:\t");
    Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
}

// Callback function that will be executed when data is received - testing purposes
void ESP32TempLogger::OnDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
    espNow_message incomingMessage;
    memcpy(&incomingMessage, incomingData, sizeof(incomingMessage));
    Serial.print("Bytes received: ");
    Serial.println(len);
    Serial.println(incomingMessage.dateAndTime);
    Serial.println(incomingMessage.temperature);
}

void ESP32TempLogger::logDataToSD(const String &dataString) {
    dataFile = sd.open("temp_log.txt", O_RDWR | O_CREAT | O_AT_END);
    if (dataFile) {
        dataFile.print(dataString);
        dataFile.close();
        Serial.println("Data written to SD card.");
    } else {
        Serial.println("Error opening temp_log.txt");
    }
}